package com.company.Lesson106;

/**
 * Created by User on 04.08.2017.
 * /**
 * Created by User on 30.07.2017.
 * Новая задача: Программа вводит два имени файла. И копирует первый файл на место, заданное вторым именем.
 * Если файла (который нужно копировать) с указанным именем не существует, то
 * программа должна вывести надпись «Файл не существует.» и еще раз прочитать имя файла с консоли,
 * а уже потом считывать файл для записи.
 */
public class Test05 {
    public static void main(String[] args) {

    }

}
